	//=================PART1========================//
const number = prompt("ВВЕДІТЬ ЧИСЛО")
if (number % 2 ===0){
	alert ("ВИ ВВЕЛИ ПАРНЕ ЧИСЛО")
} else{
	alert("ВИ ВВЕЛИ НЕ ПАРНЕ ЧИСЛО")
}



	//=================PART2========================//
const days = prompt("ВВЕДІТЬ КІЛЬКІСТЬ ДНІВ")
const price = 40

if(days >= 7){
	alert(days * 40 - 50 + '$ - ЦЕ ВАША СУМА ЗІ ЗНИЖКОЮ 50$')
}else if(days > 3 && days < 7){
	alert(days * 40 - 20 + '$ - ЦЕ ВАША СУМА ЗІ ЗНИЖКОЮ 20$')
}

	 //=================PART3========================//
const years = prompt("ВВЕДІТЬ РІК")
if (years<0){
	alert("ВИ ВВЕЛИ НЕ ПРАВИЛЬНИЙ РІК")
}else{
	alert(parseInt(years/100 +1)  + " СТОЛІТТЯ")
}
